# Assignment 4: Data Preprocessing using Python (Pandas)

In this assignment, we perform various data manipulation operations
on Facebook metrics dataset and Amazon book reviews dataset.

Libraries Used:
- pandas → Data manipulation
- numpy → Numerical operations

In [1]:
import pandas as pd
import numpy as np

## Loading the Datasets

Facebook dataset uses ';' as separator.
Amazon dataset uses ',' as separator.

In [2]:
facebook_df = pd.read_csv("dataset_Facebook.csv", sep=';')
amazon_df = pd.read_csv("amazon_book_reviews.csv")

facebook_df.head()

,Page total likes,Type,Category,Post Month,Post Hour,Paid,like,share,comment
0,139441,Photo,2,12,3,0,100,20,15
1,139441,Status,3,12,10,0,150,30,25
2,139441,Video,2,11,3,1,200,50,35
3,139441,Photo,1,10,5,0,90,10,5
4,139441,Link,3,9,4,1,300,60,40

In [3]:
amazon_df.head()

   UserID  BookID  Rating  ReviewLength
0       1     101       5           200
1       2     102       4           150
2       3     103       3           300
3       4     104       5           400
4       5     105       2           120

### Using loc() – Label Based Indexing
Select rows 0–3 and columns 'like' and 'share'

In [4]:
facebook_df.loc[0:3, ['like', 'share']]

   like  share
0   100     20
1   150     30
2   200     50
3    90     10

### Using iloc() – Index Based Indexing
Select first 4 rows and first 3 columns

In [5]:
facebook_df.iloc[0:4, 0:3]

   Page total likes    Type  Category
0            139441   Photo         2
1            139441  Status         3
2            139441   Video         2
3            139441   Photo         1

### Conditional Subset
Select posts having more than 200 likes

In [6]:
facebook_df[facebook_df['like'] > 200]

,Page total likes,Type,Category,Post Month,Post Hour,Paid,like,share,comment
4,139441,Link,3,9,4,1,300,60,40
6,139441,Video,1,7,11,1,500,100,60
7,139441,Status,2,6,6,0,250,70,45

## Merging Facebook and Amazon datasets

Here we simulate merging on a common key.
We assume 'Category' in Facebook relates to 'Rating' in Amazon.

In [7]:
merged_df = pd.merge(
    facebook_df,
    amazon_df,
    left_on='Category',
    right_on='Rating',
    how='inner'
)

merged_df.head()

,Page total likes,Type,Category,Post Month,Post Hour,Paid,like,share,comment,UserID,BookID,Rating,ReviewLength
0,139441,Photo,2,12,3,0,100,20,15,5,105,2,120
1,139441,Status,3,12,10,0,150,30,25,3,103,3,300
2,139441,Video,2,11,3,1,200,50,35,5,105,2,120
3,139441,Link,3,9,4,1,300,60,40,3,103,3,300
4,139441,Status,3,12,10,0,150,30,25,8,103,3,180

## Sorting Data

Sort Facebook posts based on number of likes in descending order.

In [8]:
facebook_df.sort_values(by='like', ascending=False)

,Page total likes,Type,Category,Post Month,Post Hour,Paid,like,share,comment
6,139441,Video,1,7,11,1,500,100,60
4,139441,Link,3,9,4,1,300,60,40
7,139441,Status,2,6,6,0,250,70,45
2,139441,Video,2,11,3,1,200,50,35
1,139441,Status,3,12,10,0,150,30,25
5,139441,Photo,2,8,2,0,120,25,18
0,139441,Photo,2,12,3,0,100,20,15
3,139441,Photo,1,10,5,0,90,10,5

## Transposing Data

Transpose swaps rows and columns.

In [9]:
facebook_df.T

,0,1,2,3,4,5,6,7
Page total likes,139441,139441,139441,139441,139441,139441,139441,139441
Type,Photo,Status,Video,Photo,Link,Photo,Video,Status
Category,2,3,2,1,3,2,1,2
Post Month,12,12,11,10,9,8,7,6
Post Hour,3,10,3,5,4,2,11,6
Paid,0,0,1,0,1,0,1,0
like,100,150,200,90,300,120,500,250
share,20,30,50,10,60,25,100,70
comment,15,25,35,5,40,18,60,45

## Melting Data

Convert wide format into long format.

In [10]:
melted_df = pd.melt(
    facebook_df,
    id_vars=['Type'],
    value_vars=['like', 'share'],
    var_name='Metric',
    value_name='Value'
)

melted_df.head()

     Type Metric  Value
0   Photo   like    100
1  Status   like    150
2   Video   like    200
3   Photo   like     90
4    Link   like    300

## Pivot (Long → Wide)

Reshape melted data back to wide format.

## Pivot vs Pivot_table

The pivot() function fails when duplicate index-column combinations exist.

Since multiple posts belong to the same Type category,
we must use pivot_table() which performs aggregation.

Here we use mean to calculate average likes and shares per Type.

In [11]:
pivot_df = melted_df.pivot_table(
    index='Type',
    columns='Metric',
    values='Value',
    aggfunc='mean'   # or 'sum'
)

pivot_df

Metric        like      share
Type
Link    300.000000  60.000000
Photo   103.333333  18.333333
Status  200.000000  50.000000
Video   350.000000  75.000000

## Conclusion

In this assignment we learned:

- Creating subsets using loc() and iloc()
- Merging datasets using pd.merge()
- Sorting data using sort_values()
- Transposing data using .T
- Melting data using pd.melt()
- Casting data using pivot()

These preprocessing techniques are essential in data analytics
for cleaning, transforming, and preparing data before analysis.